; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	infrared2 - mode
	infrared0 - mode
	thermograph1 - mode
	GroundStation3 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument2 infrared2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(supports instrument3 infrared0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star5)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 infrared0)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(have_image Phenomenon6 thermograph1)
	(have_image Planet7 thermograph1)
	(have_image Phenomenon8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 infrared0)
	(have_image Star12 thermograph1)
	(have_image Star13 thermograph1)
	(have_image Star14 infrared2)
	(have_image Phenomenon15 infrared2)
	(have_image Planet16 thermograph1)
	(have_image Phenomenon17 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite1 instrument4 groundstation4)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite1 phenomenon8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 12
5. (take_image satellite1 phenomenon8 instrument4 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon6 instrument4 thermograph1)
   added: (have_image phenomenon6 thermograph1)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon17 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 12
9. (take_image satellite1 phenomenon17 instrument4 infrared2)
   added: (have_image phenomenon17 infrared2)
   goals met: 3 of 12
10. (turn_to satellite1 phenomenon15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon15)
   goals met: 3 of 12
11. (take_image satellite1 phenomenon15 instrument4 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 4 of 12
12. (turn_to satellite1 phenomenon10 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 12
13. (take_image satellite1 phenomenon10 instrument4 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 5 of 12
14. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 12
15. (take_image satellite1 phenomenon9 instrument4 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 6 of 12
16. (turn_to satellite1 planet16 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet16)
   goals met: 6 of 12
17. (take_image satellite1 planet16 instrument4 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 7 of 12
18. (turn_to satellite1 planet7 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet7)
   goals met: 7 of 12
19. (take_image satellite1 planet7 instrument4 thermograph1)
   added: (have_image planet7 thermograph1)
   goals met: 8 of 12
20. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 8 of 12
21. (take_image satellite1 star11 instrument4 infrared0)
   added: (have_image star11 infrared0)
   goals met: 9 of 12
22. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 9 of 12
23. (take_image satellite1 star12 instrument4 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 10 of 12
24. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 10 of 12
25. (take_image satellite1 star13 instrument4 thermograph1)
   added: (have_image star13 thermograph1)
   goals met: 11 of 12
26. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 11 of 12
27. (take_image satellite1 star14 instrument4 infrared2)
   added: (have_image star14 infrared2)
   goals met: 12 of 12
